MikroElektronika/core_packages/PIC/XC8/def/PIC18F57K42/mcu.h
// Register: RF5PPS
#define RF5PPS RF5PPS
extern volatile unsigned char           RF5PPS              __at(0x3A2D);
#ifndef _LIB_BUILD
asm("RF5PPS equ 03A2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF5PPS0                :1;
        unsigned RF5PPS1                :1;
        unsigned RF5PPS2                :1;
        unsigned RF5PPS3                :1;
        unsigned RF5PPS4                :1;
        unsigned RF5PPS5                :1;
    };
} RF5PPSbits_t;
extern volatile RF5PPSbits_t RF5PPSbits __at(0x3A2D);
// bitfield macros
#define _RF5PPS_RF5PPS0_POSN                                0x0
#define _RF5PPS_RF5PPS0_POSITION                            0x0
#define _RF5PPS_RF5PPS0_SIZE                                0x1
#define _RF5PPS_RF5PPS0_LENGTH                              0x1
#define _RF5PPS_RF5PPS0_MASK                                0x1
#define _RF5PPS_RF5PPS1_POSN                                0x1
#define _RF5PPS_RF5PPS1_POSITION                            0x1
#define _RF5PPS_RF5PPS1_SIZE                                0x1
#define _RF5PPS_RF5PPS1_LENGTH                              0x1
#define _RF5PPS_RF5PPS1_MASK                                0x2
#define _RF5PPS_RF5PPS2_POSN                                0x2
#define _RF5PPS_RF5PPS2_POSITION                            0x2
#define _RF5PPS_RF5PPS2_SIZE                                0x1
#define _RF5PPS_RF5PPS2_LENGTH                              0x1
#define _RF5PPS_RF5PPS2_MASK                                0x4
#define _RF5PPS_RF5PPS3_POSN                                0x3
#define _RF5PPS_RF5PPS3_POSITION                            0x3
#define _RF5PPS_RF5PPS3_SIZE                                0x1
#define _RF5PPS_RF5PPS3_LENGTH                              0x1
#define _RF5PPS_RF5PPS3_MASK                                0x8
#define _RF5PPS_RF5PPS4_POSN                                0x4
#define _RF5PPS_RF5PPS4_POSITION                            0x4
#define _RF5PPS_RF5PPS4_SIZE                                0x1
#define _RF5PPS_RF5PPS4_LENGTH                              0x1
#define _RF5PPS_RF5PPS4_MASK                                0x10
#define _RF5PPS_RF5PPS5_POSN                                0x5
#define _RF5PPS_RF5PPS5_POSITION                            0x5
#define _RF5PPS_RF5PPS5_SIZE                                0x1
#define _RF5PPS_RF5PPS5_LENGTH                              0x1
#define _RF5PPS_RF5PPS5_MASK                                0x20

// Register: RF6PPS
#define RF6PPS RF6PPS
extern volatile unsigned char           RF6PPS              __at(0x3A2E);
#ifndef _LIB_BUILD
asm("RF6PPS equ 03A2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF6PPS0                :1;
        unsigned RF6PPS1                :1;
        unsigned RF6PPS2                :1;
        unsigned RF6PPS3                :1;
        unsigned RF6PPS4                :1;
        unsigned RF6PPS5                :1;
    };
} RF6PPSbits_t;
extern volatile RF6PPSbits_t RF6PPSbits __at(0x3A2E);
// bitfield macros
#define _RF6PPS_RF6PPS0_POSN                                0x0
#define _RF6PPS_RF6PPS0_POSITION                            0x0
#define _RF6PPS_RF6PPS0_SIZE                                0x1
#define _RF6PPS_RF6PPS0_LENGTH                              0x1
#define _RF6PPS_RF6PPS0_MASK                                0x1
#define _RF6PPS_RF6PPS1_POSN                                0x1
#define _RF6PPS_RF6PPS1_POSITION                            0x1
#define _RF6PPS_RF6PPS1_SIZE                                0x1
#define _RF6PPS_RF6PPS1_LENGTH                              0x1
#define _RF6PPS_RF6PPS1_MASK                                0x2
#define _RF6PPS_RF6PPS2_POSN                                0x2
#define _RF6PPS_RF6PPS2_POSITION                            0x2
#define _RF6PPS_RF6PPS2_SIZE                                0x1
#define _RF6PPS_RF6PPS2_LENGTH                              0x1
#define _RF6PPS_RF6PPS2_MASK                                0x4
#define _RF6PPS_RF6PPS3_POSN                                0x3
#define _RF6PPS_RF6PPS3_POSITION                            0x3
#define _RF6PPS_RF6PPS3_SIZE                                0x1
#define _RF6PPS_RF6PPS3_LENGTH                              0x1
#define _RF6PPS_RF6PPS3_MASK                                0x8
#define _RF6PPS_RF6PPS4_POSN                                0x4
#define _RF6PPS_RF6PPS4_POSITION                            0x4
#define _RF6PPS_RF6PPS4_SIZE                                0x1
#define _RF6PPS_RF6PPS4_LENGTH                              0x1
#define _RF6PPS_RF6PPS4_MASK                                0x10
#define _RF6PPS_RF6PPS5_POSN                                0x5
#define _RF6PPS_RF6PPS5_POSITION                            0x5
#define _RF6PPS_RF6PPS5_SIZE                                0x1
#define _RF6PPS_RF6PPS5_LENGTH                              0x1
#define _RF6PPS_RF6PPS5_MASK                                0x20

// Register: RF7PPS
#define RF7PPS RF7PPS
extern volatile unsigned char           RF7PPS              __at(0x3A2F);
#ifndef _LIB_BUILD
asm("RF7PPS equ 03A2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF7PPS0                :1;
        unsigned RF7PPS1                :1;
        unsigned RF7PPS2                :1;
        unsigned RF7PPS3                :1;
        unsigned RF7PPS4                :1;
        unsigned RF7PPS5                :1;
    };
} RF7PPSbits_t;
extern volatile RF7PPSbits_t RF7PPSbits __at(0x3A2F);
// bitfield macros
#define _RF7PPS_RF7PPS0_POSN                                0x0
#define _RF7PPS_RF7PPS0_POSITION                            0x0
#define _RF7PPS_RF7PPS0_SIZE                                0x1
#define _RF7PPS_RF7PPS0_LENGTH                              0x1
#define _RF7PPS_RF7PPS0_MASK                                0x1
#define _RF7PPS_RF7PPS1_POSN                                0x1
#define _RF7PPS_RF7PPS1_POSITION                            0x1
#define _RF7PPS_RF7PPS1_SIZE                                0x1
#define _RF7PPS_RF7PPS1_LENGTH                              0x1
#define _RF7PPS_RF7PPS1_MASK                                0x2
#define _RF7PPS_RF7PPS2_POSN                                0x2
#define _RF7PPS_RF7PPS2_POSITION                            0x2
#define _RF7PPS_RF7PPS2_SIZE                                0x1
#define _RF7PPS_RF7PPS2_LENGTH                              0x1
#define _RF7PPS_RF7PPS2_MASK                                0x4
#define _RF7PPS_RF7PPS3_POSN                                0x3
#define _RF7PPS_RF7PPS3_POSITION                            0x3
#define _RF7PPS_RF7PPS3_SIZE                                0x1
#define _RF7PPS_RF7PPS3_LENGTH                              0x1
#define _RF7PPS_RF7PPS3_MASK                                0x8
#define _RF7PPS_RF7PPS4_POSN                                0x4
#define _RF7PPS_RF7PPS4_POSITION                            0x4
#define _RF7PPS_RF7PPS4_SIZE                                0x1
#define _RF7PPS_RF7PPS4_LENGTH                              0x1
#define _RF7PPS_RF7PPS4_MASK                                0x10
#define _RF7PPS_RF7PPS5_POSN                                0x5
#define _RF7PPS_RF7PPS5_POSITION                            0x5
#define _RF7PPS_RF7PPS5_SIZE                                0x1
#define _RF7PPS_RF7PPS5_LENGTH                              0x1
#define _RF7PPS_RF7PPS5_MASK                                0x20

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x3A40);
#ifndef _LIB_BUILD
asm("ANSELA equ 03A40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELA0                :1;
        unsigned ANSELA1                :1;
        unsigned ANSELA2                :1;
        unsigned ANSELA3                :1;
        unsigned ANSELA4                :1;
        unsigned ANSELA5                :1;
        unsigned ANSELA6                :1;
        unsigned ANSELA7                :1;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x3A40);
// bitfield macros
#define _ANSELA_ANSELA0_POSN                                0x0
#define _ANSELA_ANSELA0_POSITION                            0x0
#define _ANSELA_ANSELA0_SIZE                                0x1
#define _ANSELA_ANSELA0_LENGTH                              0x1
#define _ANSELA_ANSELA0_MASK                                0x1
#define _ANSELA_ANSELA1_POSN                                0x1
#define _ANSELA_ANSELA1_POSITION                            0x1
#define _ANSELA_ANSELA1_SIZE                                0x1
#define _ANSELA_ANSELA1_LENGTH                              0x1
#define _ANSELA_ANSELA1_MASK                                0x2
#define _ANSELA_ANSELA2_POSN                                0x2
#define _ANSELA_ANSELA2_POSITION                            0x2
#define _ANSELA_ANSELA2_SIZE                                0x1
#define _ANSELA_ANSELA2_LENGTH                              0x1
#define _ANSELA_ANSELA2_MASK                                0x4
#define _ANSELA_ANSELA3_POSN                                0x3
#define _ANSELA_ANSELA3_POSITION                            0x3
#define _ANSELA_ANSELA3_SIZE                                0x1
#define _ANSELA_ANSELA3_LENGTH                              0x1
#define _ANSELA_ANSELA3_MASK                                0x8
#define _ANSELA_ANSELA4_POSN                                0x4
#define _ANSELA_ANSELA4_POSITION                            0x4
#define _ANSELA_ANSELA4_SIZE                                0x1
#define _ANSELA_ANSELA4_LENGTH                              0x1
#define _ANSELA_ANSELA4_MASK                                0x10
#define _ANSELA_ANSELA5_POSN                                0x5
#define _ANSELA_ANSELA5_POSITION                            0x5
#define _ANSELA_ANSELA5_SIZE                                0x1
#define _ANSELA_ANSELA5_LENGTH                              0x1
#define _ANSELA_ANSELA5_MASK                                0x20
#define _ANSELA_ANSELA6_POSN                                0x6
#define _ANSELA_ANSELA6_POSITION                            0x6
#define _ANSELA_ANSELA6_SIZE                                0x1
#define _ANSELA_ANSELA6_LENGTH                              0x1
#define _ANSELA_ANSELA6_MASK                                0x40
#define _ANSELA_ANSELA7_POSN                                0x7
#define _ANSELA_ANSELA7_POSITION                            0x7
#define _ANSELA_ANSELA7_SIZE                                0x1
#define _ANSELA_ANSELA7_LENGTH                              0x1
#define _ANSELA_ANSELA7_MASK                                0x80

