MikroElektronika/core_packages/PIC/XC8/def/PIC18F57K42/mcu.h
// Register: I2C2CON2
#define I2C2CON2 I2C2CON2
extern volatile unsigned char           I2C2CON2            __at(0x3D5F);
#ifndef _LIB_BUILD
asm("I2C2CON2 equ 03D5Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BFRET                  :2;
        unsigned SDAHT                  :2;
        unsigned ABD                    :1;
        unsigned FME                    :1;
        unsigned GCEN                   :1;
        unsigned ACNT                   :1;
    };
    struct {
        unsigned BFRET0                 :1;
        unsigned BFRET1                 :1;
        unsigned SDAHT0                 :1;
        unsigned SDAHT1                 :1;
    };
} I2C2CON2bits_t;
extern volatile I2C2CON2bits_t I2C2CON2bits __at(0x3D5F);
// bitfield macros
#define _I2C2CON2_BFRET_POSN                                0x0
#define _I2C2CON2_BFRET_POSITION                            0x0
#define _I2C2CON2_BFRET_SIZE                                0x2
#define _I2C2CON2_BFRET_LENGTH                              0x2
#define _I2C2CON2_BFRET_MASK                                0x3
#define _I2C2CON2_SDAHT_POSN                                0x2
#define _I2C2CON2_SDAHT_POSITION                            0x2
#define _I2C2CON2_SDAHT_SIZE                                0x2
#define _I2C2CON2_SDAHT_LENGTH                              0x2
#define _I2C2CON2_SDAHT_MASK                                0xC
#define _I2C2CON2_ABD_POSN                                  0x4
#define _I2C2CON2_ABD_POSITION                              0x4
#define _I2C2CON2_ABD_SIZE                                  0x1
#define _I2C2CON2_ABD_LENGTH                                0x1
#define _I2C2CON2_ABD_MASK                                  0x10
#define _I2C2CON2_FME_POSN                                  0x5
#define _I2C2CON2_FME_POSITION                              0x5
#define _I2C2CON2_FME_SIZE                                  0x1
#define _I2C2CON2_FME_LENGTH                                0x1
#define _I2C2CON2_FME_MASK                                  0x20
#define _I2C2CON2_GCEN_POSN                                 0x6
#define _I2C2CON2_GCEN_POSITION                             0x6
#define _I2C2CON2_GCEN_SIZE                                 0x1
#define _I2C2CON2_GCEN_LENGTH                               0x1
#define _I2C2CON2_GCEN_MASK                                 0x40
#define _I2C2CON2_ACNT_POSN                                 0x7
#define _I2C2CON2_ACNT_POSITION                             0x7
#define _I2C2CON2_ACNT_SIZE                                 0x1
#define _I2C2CON2_ACNT_LENGTH                               0x1
#define _I2C2CON2_ACNT_MASK                                 0x80
#define _I2C2CON2_BFRET0_POSN                               0x0
#define _I2C2CON2_BFRET0_POSITION                           0x0
#define _I2C2CON2_BFRET0_SIZE                               0x1
#define _I2C2CON2_BFRET0_LENGTH                             0x1
#define _I2C2CON2_BFRET0_MASK                               0x1
#define _I2C2CON2_BFRET1_POSN                               0x1
#define _I2C2CON2_BFRET1_POSITION                           0x1
#define _I2C2CON2_BFRET1_SIZE                               0x1
#define _I2C2CON2_BFRET1_LENGTH                             0x1
#define _I2C2CON2_BFRET1_MASK                               0x2
#define _I2C2CON2_SDAHT0_POSN                               0x2
#define _I2C2CON2_SDAHT0_POSITION                           0x2
#define _I2C2CON2_SDAHT0_SIZE                               0x1
#define _I2C2CON2_SDAHT0_LENGTH                             0x1
#define _I2C2CON2_SDAHT0_MASK                               0x4
#define _I2C2CON2_SDAHT1_POSN                               0x3
#define _I2C2CON2_SDAHT1_POSITION                           0x3
#define _I2C2CON2_SDAHT1_SIZE                               0x1
#define _I2C2CON2_SDAHT1_LENGTH                             0x1
#define _I2C2CON2_SDAHT1_MASK                               0x8

// Register: I2C2ERR
#define I2C2ERR I2C2ERR
extern volatile unsigned char           I2C2ERR             __at(0x3D60);
#ifndef _LIB_BUILD
asm("I2C2ERR equ 03D60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NACKIE                 :1;
        unsigned BCLIE                  :1;
        unsigned BTOIE                  :1;
        unsigned                        :1;
        unsigned NACKIF                 :1;
        unsigned BCLIF                  :1;
        unsigned BTOIF                  :1;
    };
    struct {
        unsigned NACK2IE                :1;
        unsigned BCL2IE                 :1;
        unsigned BTO2IE                 :1;
        unsigned                        :1;
        unsigned NACK2IF                :1;
        unsigned BCL2IF                 :1;
        unsigned BTO2IF                 :1;
    };
} I2C2ERRbits_t;
extern volatile I2C2ERRbits_t I2C2ERRbits __at(0x3D60);
// bitfield macros
#define _I2C2ERR_NACKIE_POSN                                0x0
#define _I2C2ERR_NACKIE_POSITION                            0x0
#define _I2C2ERR_NACKIE_SIZE                                0x1
#define _I2C2ERR_NACKIE_LENGTH                              0x1
#define _I2C2ERR_NACKIE_MASK                                0x1
#define _I2C2ERR_BCLIE_POSN                                 0x1
#define _I2C2ERR_BCLIE_POSITION                             0x1
#define _I2C2ERR_BCLIE_SIZE                                 0x1
#define _I2C2ERR_BCLIE_LENGTH                               0x1
#define _I2C2ERR_BCLIE_MASK                                 0x2
#define _I2C2ERR_BTOIE_POSN                                 0x2
#define _I2C2ERR_BTOIE_POSITION                             0x2
#define _I2C2ERR_BTOIE_SIZE                                 0x1
#define _I2C2ERR_BTOIE_LENGTH                               0x1
#define _I2C2ERR_BTOIE_MASK                                 0x4
#define _I2C2ERR_NACKIF_POSN                                0x4
#define _I2C2ERR_NACKIF_POSITION                            0x4
#define _I2C2ERR_NACKIF_SIZE                                0x1
#define _I2C2ERR_NACKIF_LENGTH                              0x1
#define _I2C2ERR_NACKIF_MASK                                0x10
#define _I2C2ERR_BCLIF_POSN                                 0x5
#define _I2C2ERR_BCLIF_POSITION                             0x5
#define _I2C2ERR_BCLIF_SIZE                                 0x1
#define _I2C2ERR_BCLIF_LENGTH                               0x1
#define _I2C2ERR_BCLIF_MASK                                 0x20
#define _I2C2ERR_BTOIF_POSN                                 0x6
#define _I2C2ERR_BTOIF_POSITION                             0x6
#define _I2C2ERR_BTOIF_SIZE                                 0x1
#define _I2C2ERR_BTOIF_LENGTH                               0x1
#define _I2C2ERR_BTOIF_MASK                                 0x40
#define _I2C2ERR_NACK2IE_POSN                               0x0
#define _I2C2ERR_NACK2IE_POSITION                           0x0
#define _I2C2ERR_NACK2IE_SIZE                               0x1
#define _I2C2ERR_NACK2IE_LENGTH                             0x1
#define _I2C2ERR_NACK2IE_MASK                               0x1
#define _I2C2ERR_BCL2IE_POSN                                0x1
#define _I2C2ERR_BCL2IE_POSITION                            0x1
#define _I2C2ERR_BCL2IE_SIZE                                0x1
#define _I2C2ERR_BCL2IE_LENGTH                              0x1
#define _I2C2ERR_BCL2IE_MASK                                0x2
#define _I2C2ERR_BTO2IE_POSN                                0x2
#define _I2C2ERR_BTO2IE_POSITION                            0x2
#define _I2C2ERR_BTO2IE_SIZE                                0x1
#define _I2C2ERR_BTO2IE_LENGTH                              0x1
#define _I2C2ERR_BTO2IE_MASK                                0x4
#define _I2C2ERR_NACK2IF_POSN                               0x4
#define _I2C2ERR_NACK2IF_POSITION                           0x4
#define _I2C2ERR_NACK2IF_SIZE                               0x1
#define _I2C2ERR_NACK2IF_LENGTH                             0x1
#define _I2C2ERR_NACK2IF_MASK                               0x10
#define _I2C2ERR_BCL2IF_POSN                                0x5
#define _I2C2ERR_BCL2IF_POSITION                            0x5
#define _I2C2ERR_BCL2IF_SIZE                                0x1
#define _I2C2ERR_BCL2IF_LENGTH                              0x1
#define _I2C2ERR_BCL2IF_MASK                                0x20
#define _I2C2ERR_BTO2IF_POSN                                0x6
#define _I2C2ERR_BTO2IF_POSITION                            0x6
#define _I2C2ERR_BTO2IF_SIZE                                0x1
#define _I2C2ERR_BTO2IF_LENGTH                              0x1
#define _I2C2ERR_BTO2IF_MASK                                0x40

