MikroElektronika/core_packages/PIC/XC8/def/PIC18F57K42/mcu.h
// NVMDAT<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0x1CF18);	// @ (0x39E3 * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDAT,0)
// NVMDAT<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0x1CF19);	// @ (0x39E3 * 8 + 1)
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDAT,1)
// NVMDAT<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0x1CF1A);	// @ (0x39E3 * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDAT,2)
// NVMDAT<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0x1CF1B);	// @ (0x39E3 * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDAT,3)
// NVMDAT<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0x1CF1C);	// @ (0x39E3 * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDAT,4)
// NVMDAT<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0x1CF1D);	// @ (0x39E3 * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDAT,5)
// NVMDAT<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0x1CF1E);	// @ (0x39E3 * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDAT,6)
// NVMDAT<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0x1CF1F);	// @ (0x39E3 * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDAT,7)
// PIE0<NVMIE>
extern volatile __bit                   NVMIE               __at(0x1CC84);	// @ (0x3990 * 8 + 4)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE0,4)
// PIR0<NVMIF>
extern volatile __bit                   NVMIF               __at(0x1CD04);	// @ (0x39A0 * 8 + 4)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR0,4)
// IPR0<NVMIP>
extern volatile __bit                   NVMIP               __at(0x1CC04);	// @ (0x3980 * 8 + 4)
#define                                 NVMIP_bit           _BIT_ACCESS(IPR0,4)
// PMD0<NVMMD>
extern volatile __bit                   NVMMD               __at(0x1CE02);	// @ (0x39C0 * 8 + 2)
#define                                 NVMMD_bit           _BIT_ACCESS(PMD0,2)
// NVMCON1<NVMREG0>
extern volatile __bit                   NVMREG0             __at(0x1CF2E);	// @ (0x39E5 * 8 + 6)
#define                                 NVMREG0_bit         _BIT_ACCESS(NVMCON1,6)
// NVMCON1<NVMREG1>
extern volatile __bit                   NVMREG1             __at(0x1CF2F);	// @ (0x39E5 * 8 + 7)
#define                                 NVMREG1_bit         _BIT_ACCESS(NVMCON1,7)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0x1D210);	// @ (0x3A42 * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0x1D211);	// @ (0x3A42 * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0x1D212);	// @ (0x3A42 * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA3>
extern volatile __bit                   ODCA3               __at(0x1D213);	// @ (0x3A42 * 8 + 3)
#define                                 ODCA3_bit           _BIT_ACCESS(ODCONA,3)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0x1D214);	// @ (0x3A42 * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0x1D215);	// @ (0x3A42 * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONA<ODCA6>
extern volatile __bit                   ODCA6               __at(0x1D216);	// @ (0x3A42 * 8 + 6)
#define                                 ODCA6_bit           _BIT_ACCESS(ODCONA,6)
// ODCONA<ODCA7>
extern volatile __bit                   ODCA7               __at(0x1D217);	// @ (0x3A42 * 8 + 7)
#define                                 ODCA7_bit           _BIT_ACCESS(ODCONA,7)
// ODCONB<ODCB0>
extern volatile __bit                   ODCB0               __at(0x1D290);	// @ (0x3A52 * 8 + 0)
#define                                 ODCB0_bit           _BIT_ACCESS(ODCONB,0)
// ODCONB<ODCB1>
extern volatile __bit                   ODCB1               __at(0x1D291);	// @ (0x3A52 * 8 + 1)
#define                                 ODCB1_bit           _BIT_ACCESS(ODCONB,1)
// ODCONB<ODCB2>
extern volatile __bit                   ODCB2               __at(0x1D292);	// @ (0x3A52 * 8 + 2)
#define                                 ODCB2_bit           _BIT_ACCESS(ODCONB,2)
// ODCONB<ODCB3>
extern volatile __bit                   ODCB3               __at(0x1D293);	// @ (0x3A52 * 8 + 3)
#define                                 ODCB3_bit           _BIT_ACCESS(ODCONB,3)
// ODCONB<ODCB4>
extern volatile __bit                   ODCB4               __at(0x1D294);	// @ (0x3A52 * 8 + 4)
#define                                 ODCB4_bit           _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCB5>
extern volatile __bit                   ODCB5               __at(0x1D295);	// @ (0x3A52 * 8 + 5)
#define                                 ODCB5_bit           _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCB6>
extern volatile __bit                   ODCB6               __at(0x1D296);	// @ (0x3A52 * 8 + 6)
#define                                 ODCB6_bit           _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCB7>
extern volatile __bit                   ODCB7               __at(0x1D297);	// @ (0x3A52 * 8 + 7)
#define                                 ODCB7_bit           _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x1D310);	// @ (0x3A62 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x1D311);	// @ (0x3A62 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0x1D312);	// @ (0x3A62 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x1D313);	// @ (0x3A62 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x1D314);	// @ (0x3A62 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x1D315);	// @ (0x3A62 * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0x1D316);	// @ (0x3A62 * 8 + 6)
#define                                 ODCC6_bit           _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCC7>
extern volatile __bit                   ODCC7               __at(0x1D317);	// @ (0x3A62 * 8 + 7)
#define                                 ODCC7_bit           _BIT_ACCESS(ODCONC,7)
// ODCOND<ODCD0>
extern volatile __bit                   ODCD0               __at(0x1D390);	// @ (0x3A72 * 8 + 0)
#define                                 ODCD0_bit           _BIT_ACCESS(ODCOND,0)
// ODCOND<ODCD1>
extern volatile __bit                   ODCD1               __at(0x1D391);	// @ (0x3A72 * 8 + 1)
#define                                 ODCD1_bit           _BIT_ACCESS(ODCOND,1)
// ODCOND<ODCD2>
extern volatile __bit                   ODCD2               __at(0x1D392);	// @ (0x3A72 * 8 + 2)
#define                                 ODCD2_bit           _BIT_ACCESS(ODCOND,2)
// ODCOND<ODCD3>
extern volatile __bit                   ODCD3               __at(0x1D393);	// @ (0x3A72 * 8 + 3)
#define                                 ODCD3_bit           _BIT_ACCESS(ODCOND,3)
// ODCOND<ODCD4>
extern volatile __bit                   ODCD4               __at(0x1D394);	// @ (0x3A72 * 8 + 4)
#define                                 ODCD4_bit           _BIT_ACCESS(ODCOND,4)
// ODCOND<ODCD5>
extern volatile __bit                   ODCD5               __at(0x1D395);	// @ (0x3A72 * 8 + 5)
#define                                 ODCD5_bit           _BIT_ACCESS(ODCOND,5)
// ODCOND<ODCD6>
extern volatile __bit                   ODCD6               __at(0x1D396);	// @ (0x3A72 * 8 + 6)
#define                                 ODCD6_bit           _BIT_ACCESS(ODCOND,6)
// ODCOND<ODCD7>
extern volatile __bit                   ODCD7               __at(0x1D397);	// @ (0x3A72 * 8 + 7)
#define                                 ODCD7_bit           _BIT_ACCESS(ODCOND,7)
// ODCONE<ODCE0>
extern volatile __bit                   ODCE0               __at(0x1D410);	// @ (0x3A82 * 8 + 0)
#define                                 ODCE0_bit           _BIT_ACCESS(ODCONE,0)
// ODCONE<ODCE1>
extern volatile __bit                   ODCE1               __at(0x1D411);	// @ (0x3A82 * 8 + 1)
#define                                 ODCE1_bit           _BIT_ACCESS(ODCONE,1)
// ODCONE<ODCE2>
extern volatile __bit                   ODCE2               __at(0x1D412);	// @ (0x3A82 * 8 + 2)
#define                                 ODCE2_bit           _BIT_ACCESS(ODCONE,2)
// ODCONF<ODCF0>
extern volatile __bit                   ODCF0               __at(0x1D490);	// @ (0x3A92 * 8 + 0)
#define                                 ODCF0_bit           _BIT_ACCESS(ODCONF,0)
// ODCONF<ODCF1>
extern volatile __bit                   ODCF1               __at(0x1D491);	// @ (0x3A92 * 8 + 1)
#define                                 ODCF1_bit           _BIT_ACCESS(ODCONF,1)
// ODCONF<ODCF2>
extern volatile __bit                   ODCF2               __at(0x1D492);	// @ (0x3A92 * 8 + 2)
#define                                 ODCF2_bit           _BIT_ACCESS(ODCONF,2)
// ODCONF<ODCF3>
extern volatile __bit                   ODCF3               __at(0x1D493);	// @ (0x3A92 * 8 + 3)
#define                                 ODCF3_bit           _BIT_ACCESS(ODCONF,3)
// ODCONF<ODCF4>
extern volatile __bit                   ODCF4               __at(0x1D494);	// @ (0x3A92 * 8 + 4)
#define                                 ODCF4_bit           _BIT_ACCESS(ODCONF,4)
// ODCONF<ODCF5>
extern volatile __bit                   ODCF5               __at(0x1D495);	// @ (0x3A92 * 8 + 5)
#define                                 ODCF5_bit           _BIT_ACCESS(ODCONF,5)
// ODCONF<ODCF6>
extern volatile __bit                   ODCF6               __at(0x1D496);	// @ (0x3A92 * 8 + 6)
#define                                 ODCF6_bit           _BIT_ACCESS(ODCONF,6)
// ODCONF<ODCF7>
extern volatile __bit                   ODCF7               __at(0x1D497);	// @ (0x3A92 * 8 + 7)
#define                                 ODCF7_bit           _BIT_ACCESS(ODCONF,7)
// DAC1CON0<OE1>
extern volatile __bit                   OE1                 __at(0x1F4F5);	// @ (0x3E9E * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<OE2>
extern volatile __bit                   OE2                 __at(0x1F4F4);	// @ (0x3E9E * 8 + 4)
#define                                 OE2_bit             _BIT_ACCESS(DAC1CON0,4)
// MD1CON0<OPOL>
extern volatile __bit                   OPOL                __at(0x1E7D4);	// @ (0x3CFA * 8 + 4)
#define                                 OPOL_bit            _BIT_ACCESS(MD1CON0,4)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x1CEDC);	// @ (0x39DB * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// PIE0<OSFIE>
extern volatile __bit                   OSFIE               __at(0x1CC82);	// @ (0x3990 * 8 + 2)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE0,2)
// PIR0<OSFIF>
extern volatile __bit                   OSFIF               __at(0x1CD02);	// @ (0x39A0 * 8 + 2)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR0,2)
// IPR0<OSFIP>
extern volatile __bit                   OSFIP               __at(0x1CC02);	// @ (0x3980 * 8 + 2)
#define                                 OSFIP_bit           _BIT_ACCESS(IPR0,2)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x1FEC3);	// @ (0x3FD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// U1P1H<P1H>
extern volatile __bit                   P1H                 __at(0x1EF68);	// @ (0x3DED * 8 + 0)
#define                                 P1H_bit             _BIT_ACCESS(U1P1H,0)
// U1P2H<P2H>
extern volatile __bit                   P2H                 __at(0x1EF78);	// @ (0x3DEF * 8 + 0)
#define                                 P2H_bit             _BIT_ACCESS(U1P2H,0)
// U1P3H<P3H>
extern volatile __bit                   P3H                 __at(0x1EF88);	// @ (0x3DF1 * 8 + 0)
#define                                 P3H_bit             _BIT_ACCESS(U1P3H,0)
// CCPTMRS1<P5TSEL0>
extern volatile __bit                   P5TSEL0             __at(0x1FAF8);	// @ (0x3F5F * 8 + 0)
#define                                 P5TSEL0_bit         _BIT_ACCESS(CCPTMRS1,0)
// CCPTMRS1<P5TSEL1>
extern volatile __bit                   P5TSEL1             __at(0x1FAF9);	// @ (0x3F5F * 8 + 1)
#define                                 P5TSEL1_bit         _BIT_ACCESS(CCPTMRS1,1)
// CCPTMRS1<P6TSEL0>
extern volatile __bit                   P6TSEL0             __at(0x1FAFA);	// @ (0x3F5F * 8 + 2)
#define                                 P6TSEL0_bit         _BIT_ACCESS(CCPTMRS1,2)
// CCPTMRS1<P6TSEL1>
extern volatile __bit                   P6TSEL1             __at(0x1FAFB);	// @ (0x3F5F * 8 + 3)
#define                                 P6TSEL1_bit         _BIT_ACCESS(CCPTMRS1,3)
// CCPTMRS1<P7TSEL0>
extern volatile __bit                   P7TSEL0             __at(0x1FAFC);	// @ (0x3F5F * 8 + 4)
#define                                 P7TSEL0_bit         _BIT_ACCESS(CCPTMRS1,4)
// CCPTMRS1<P7TSEL1>
extern volatile __bit                   P7TSEL1             __at(0x1FAFD);	// @ (0x3F5F * 8 + 5)
#define                                 P7TSEL1_bit         _BIT_ACCESS(CCPTMRS1,5)
// CCPTMRS1<P8TSEL0>
extern volatile __bit                   P8TSEL0             __at(0x1FAFE);	// @ (0x3F5F * 8 + 6)
#define                                 P8TSEL0_bit         _BIT_ACCESS(CCPTMRS1,6)
// CCPTMRS1<P8TSEL1>
extern volatile __bit                   P8TSEL1             __at(0x1FAFF);	// @ (0x3F5F * 8 + 7)
#define                                 P8TSEL1_bit         _BIT_ACCESS(CCPTMRS1,7)
// I2C1PIE<PC1IE>
extern volatile __bit                   PC1IE               __at(0x1EBD2);	// @ (0x3D7A * 8 + 2)
#define                                 PC1IE_bit           _BIT_ACCESS(I2C1PIE,2)
// I2C1PIR<PC1IF>
extern volatile __bit                   PC1IF               __at(0x1EBCA);	// @ (0x3D79 * 8 + 2)
#define                                 PC1IF_bit           _BIT_ACCESS(I2C1PIR,2)
// I2C2PIE<PC2IE>
extern volatile __bit                   PC2IE               __at(0x1EB22);	// @ (0x3D64 * 8 + 2)
#define                                 PC2IE_bit           _BIT_ACCESS(I2C2PIE,2)
// I2C2PIR<PC2IF>
extern volatile __bit                   PC2IF               __at(0x1EB1A);	// @ (0x3D63 * 8 + 2)
#define                                 PC2IF_bit           _BIT_ACCESS(I2C2PIR,2)
// ADPCH<PCH3>
extern volatile __bit                   PCH3                __at(0x1F78B);	// @ (0x3EF1 * 8 + 3)
#define                                 PCH3_bit            _BIT_ACCESS(ADPCH,3)
// ADPCH<PCH4>
extern volatile __bit                   PCH4                __at(0x1F78C);	// @ (0x3EF1 * 8 + 4)
#define                                 PCH4_bit            _BIT_ACCESS(ADPCH,4)
// ADPCH<PCH5>
extern volatile __bit                   PCH5                __at(0x1F78D);	// @ (0x3EF1 * 8 + 5)
#define                                 PCH5_bit            _BIT_ACCESS(ADPCH,5)
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x1F9F0);	// @ (0x3F3E * 8 + 0)
#define                                 PFM_bit             _BIT_ACCESS(NCO1CON,0)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0x1CB48);	// @ (0x3969 * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0x1CB49);	// @ (0x3969 * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0x1CB4A);	// @ (0x3969 * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0x1CB4B);	// @ (0x3969 * 8 + 3)
#define                                 PLEN3_bit           _BIT_ACCESS(CRCCON1,3)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x1CEE0);	// @ (0x39DC * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,0)
// PCON0<POR>
extern volatile __bit                   POR                 __at(0x1FF81);	// @ (0x3FF0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(PCON0,1)
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0x1F7CF);	// @ (0x3EF9 * 8 + 7)
#define                                 PPOL_bit            _BIT_ACCESS(ADCON1,7)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x1D5F8);	// @ (0x3ABF * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// SMT1PRH<PR10>
extern volatile __bit                   PR10                __at(0x1F8E2);	// @ (0x3F1C * 8 + 2)
#define                                 PR10_bit            _BIT_ACCESS(SMT1PRH,2)
// SMT1PRH<PR11>
extern volatile __bit                   PR11                __at(0x1F8E3);	// @ (0x3F1C * 8 + 3)
#define                                 PR11_bit            _BIT_ACCESS(SMT1PRH,3)
// SMT1PRH<PR12>
extern volatile __bit                   PR12                __at(0x1F8E4);	// @ (0x3F1C * 8 + 4)
#define                                 PR12_bit            _BIT_ACCESS(SMT1PRH,4)
// SMT1PRH<PR13>
extern volatile __bit                   PR13                __at(0x1F8E5);	// @ (0x3F1C * 8 + 5)
#define                                 PR13_bit            _BIT_ACCESS(SMT1PRH,5)
// SMT1PRH<PR14>
extern volatile __bit                   PR14                __at(0x1F8E6);	// @ (0x3F1C * 8 + 6)
#define                                 PR14_bit            _BIT_ACCESS(SMT1PRH,6)
// SMT1PRH<PR15>
extern volatile __bit                   PR15                __at(0x1F8E7);	// @ (0x3F1C * 8 + 7)
#define                                 PR15_bit            _BIT_ACCESS(SMT1PRH,7)
// SMT1PRU<PR16>
extern volatile __bit                   PR16                __at(0x1F8E8);	// @ (0x3F1D * 8 + 0)
#define                                 PR16_bit            _BIT_ACCESS(SMT1PRU,0)
// SMT1PRU<PR17>
extern volatile __bit                   PR17                __at(0x1F8E9);	// @ (0x3F1D * 8 + 1)
#define                                 PR17_bit            _BIT_ACCESS(SMT1PRU,1)
// SMT1PRU<PR18>
extern volatile __bit                   PR18                __at(0x1F8EA);	// @ (0x3F1D * 8 + 2)
#define                                 PR18_bit            _BIT_ACCESS(SMT1PRU,2)
// SMT1PRU<PR19>
extern volatile __bit                   PR19                __at(0x1F8EB);	// @ (0x3F1D * 8 + 3)
#define                                 PR19_bit            _BIT_ACCESS(SMT1PRU,3)
// SMT1PRU<PR20>
extern volatile __bit                   PR20                __at(0x1F8EC);	// @ (0x3F1D * 8 + 4)
#define                                 PR20_bit            _BIT_ACCESS(SMT1PRU,4)
// SMT1PRU<PR21>
extern volatile __bit                   PR21                __at(0x1F8ED);	// @ (0x3F1D * 8 + 5)
#define                                 PR21_bit            _BIT_ACCESS(SMT1PRU,5)
// SMT1PRU<PR22>
extern volatile __bit                   PR22                __at(0x1F8EE);	// @ (0x3F1D * 8 + 6)
#define                                 PR22_bit            _BIT_ACCESS(SMT1PRU,6)
// SMT1PRU<PR23>
extern volatile __bit                   PR23                __at(0x1F8EF);	// @ (0x3F1D * 8 + 7)
#define                                 PR23_bit            _BIT_ACCESS(SMT1PRU,7)
// SMT1PRL<PR7>
extern volatile __bit                   PR7                 __at(0x1F8DF);	// @ (0x3F1B * 8 + 7)
#define                                 PR7_bit             _BIT_ACCESS(SMT1PRL,7)
// SMT1PRH<PR8>
extern volatile __bit                   PR8                 __at(0x1F8E0);	// @ (0x3F1C * 8 + 0)
#define                                 PR8_bit             _BIT_ACCESS(SMT1PRH,0)
// SMT1PRH<PR9>
extern volatile __bit                   PR9                 __at(0x1F8E1);	// @ (0x3F1C * 8 + 1)
#define                                 PR9_bit             _BIT_ACCESS(SMT1PRH,1)
// ADPREL<PRE0>
extern volatile __bit                   PRE0                __at(0x1F7B0);	// @ (0x3EF6 * 8 + 0)
#define                                 PRE0_bit            _BIT_ACCESS(ADPREL,0)
// ADPREL<PRE1>
extern volatile __bit                   PRE1                __at(0x1F7B1);	// @ (0x3EF6 * 8 + 1)
#define                                 PRE1_bit            _BIT_ACCESS(ADPREL,1)
// ADPREH<PRE10>
extern volatile __bit                   PRE10               __at(0x1F7BA);	// @ (0x3EF7 * 8 + 2)
#define                                 PRE10_bit           _BIT_ACCESS(ADPREH,2)
// ADPREH<PRE11>
extern volatile __bit                   PRE11               __at(0x1F7BB);	// @ (0x3EF7 * 8 + 3)
#define                                 PRE11_bit           _BIT_ACCESS(ADPREH,3)
// ADPREH<PRE12>
extern volatile __bit                   PRE12               __at(0x1F7BC);	// @ (0x3EF7 * 8 + 4)
#define                                 PRE12_bit           _BIT_ACCESS(ADPREH,4)
// ADPREL<PRE2>
extern volatile __bit                   PRE2                __at(0x1F7B2);	// @ (0x3EF6 * 8 + 2)
#define                                 PRE2_bit            _BIT_ACCESS(ADPREL,2)
// ADPREL<PRE3>
extern volatile __bit                   PRE3                __at(0x1F7B3);	// @ (0x3EF6 * 8 + 3)
#define                                 PRE3_bit            _BIT_ACCESS(ADPREL,3)
// ADPREL<PRE4>
extern volatile __bit                   PRE4                __at(0x1F7B4);	// @ (0x3EF6 * 8 + 4)
#define                                 PRE4_bit            _BIT_ACCESS(ADPREL,4)
// ADPREL<PRE5>
extern volatile __bit                   PRE5                __at(0x1F7B5);	// @ (0x3EF6 * 8 + 5)
#define                                 PRE5_bit            _BIT_ACCESS(ADPREL,5)
// ADPREL<PRE6>
extern volatile __bit                   PRE6                __at(0x1F7B6);	// @ (0x3EF6 * 8 + 6)
#define                                 PRE6_bit            _BIT_ACCESS(ADPREL,6)
// ADPREL<PRE7>
extern volatile __bit                   PRE7                __at(0x1F7B7);	// @ (0x3EF6 * 8 + 7)
#define                                 PRE7_bit            _BIT_ACCESS(ADPREL,7)
// ADPREH<PRE8>
extern volatile __bit                   PRE8                __at(0x1F7B8);	// @ (0x3EF7 * 8 + 0)
#define                                 PRE8_bit            _BIT_ACCESS(ADPREH,0)
// ADPREH<PRE9>
extern volatile __bit                   PRE9                __at(0x1F7B9);	// @ (0x3EF7 * 8 + 1)
#define                                 PRE9_bit            _BIT_ACCESS(ADPREH,1)
// ADREF<PREF0>
